{
  "vocab": [
    " ",
    "!",
    "\"",
    "'",
    ",",
    "-",
    ".",
    ":",
    ";",
    "?",
    "A",
    "B",
    "C",
    "D",
    "E",
    "F",
    "G",
    "H",
    "I",
    "J",
    "L",
    "M",
    "N",
    "O",
    "P",
    "R",
    "S",
    "T",
    "W",
    "Y",
    "Z",
    "a",
    "b",
    "c",
    "d",
    "e",
    "f",
    "g",
    "h",
    "i",
    "j",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "w",
    "x",
    "y",
    "z",
    "â",
    "œ",
    "€",
    "™"
  ],
  "char_to_id": {
    " ": 0,
    "!": 1,
    "\"": 2,
    "'": 3,
    ",": 4,
    "-": 5,
    ".": 6,
    ":": 7,
    ";": 8,
    "?": 9,
    "A": 10,
    "B": 11,
    "C": 12,
    "D": 13,
    "E": 14,
    "F": 15,
    "G": 16,
    "H": 17,
    "I": 18,
    "J": 19,
    "L": 20,
    "M": 21,
    "N": 22,
    "O": 23,
    "P": 24,
    "R": 25,
    "S": 26,
    "T": 27,
    "W": 28,
    "Y": 29,
    "Z": 30,
    "a": 31,
    "b": 32,
    "c": 33,
    "d": 34,
    "e": 35,
    "f": 36,
    "g": 37,
    "h": 38,
    "i": 39,
    "j": 40,
    "k": 41,
    "l": 42,
    "m": 43,
    "n": 44,
    "o": 45,
    "p": 46,
    "q": 47,
    "r": 48,
    "s": 49,
    "t": 50,
    "u": 51,
    "v": 52,
    "w": 53,
    "x": 54,
    "y": 55,
    "z": 56,
    "â": 57,
    "œ": 58,
    "€": 59,
    "™": 60
  },
  "id_to_char": {
    "0": " ",
    "1": "!",
    "2": "\"",
    "3": "'",
    "4": ",",
    "5": "-",
    "6": ".",
    "7": ":",
    "8": ";",
    "9": "?",
    "10": "A",
    "11": "B",
    "12": "C",
    "13": "D",
    "14": "E",
    "15": "F",
    "16": "G",
    "17": "H",
    "18": "I",
    "19": "J",
    "20": "L",
    "21": "M",
    "22": "N",
    "23": "O",
    "24": "P",
    "25": "R",
    "26": "S",
    "27": "T",
    "28": "W",
    "29": "Y",
    "30": "Z",
    "31": "a",
    "32": "b",
    "33": "c",
    "34": "d",
    "35": "e",
    "36": "f",
    "37": "g",
    "38": "h",
    "39": "i",
    "40": "j",
    "41": "k",
    "42": "l",
    "43": "m",
    "44": "n",
    "45": "o",
    "46": "p",
    "47": "q",
    "48": "r",
    "49": "s",
    "50": "t",
    "51": "u",
    "52": "v",
    "53": "w",
    "54": "x",
    "55": "y",
    "56": "z",
    "57": "â",
    "58": "œ",
    "59": "€",
    "60": "™"
  }
}